{
  "title" : "Employee Capacity Report",
  "titleIconName": "MdOutlineReduceCapacity",
  "subTitle": "Automated employee capacity and utilisation reporting",
  "overviewContent": "Developed an automated system to generate employee capacity reports, providing both individual and supervisory insights into time recording. The solution streamlines tracking of billable and non-billable hours, enabling more efficient resource management and workload planning. By automating reminders and reporting, the system improved organisational visibility, enhanced operational efficiency, and supported strategic decision-making on staffing and utilisation.",
  "position": "Full Stack Java Developer",
  "period": "2 months (May 2023 – Jul 2023)",
  "details": {
    "skillIds": [
      "java",
      "thymeleaf",
      "springboot",
      "html",
      "css",
      "javascript",
      "mariadb",
      "awsEb"
    ],
    "jd": [
      "Analysed time recording requirements for both junior staff and supervisors to ensure comprehensive capacity reporting.",
      "Extracted and processed time recording data from ActionStep, the legal practice management system, to calculate billable and non-billable hours accurately.",
      "Planned and managed the project workflow to deliver timely, accurate reports every Monday for past week and month periods.",
      "Set up development and production environments to support automated report generation and email distribution.",
      "Designed and implemented the database schema for tracking billable and non-billable hours across all relevant staff.",
      "Developed the scheduler to automate capacity report generation and email notifications, considering working days, public holidays, and leave.",
      "Conducted unit and integration testing to ensure accuracy and reliability of the reports.",
      "Documented technical design and deployment processes for maintainability and team reference."
    ]
  },
  "imgs": [
    {
      "desc" : "Email Template"
      , "url" : "/images/experiences/employee-capacity-report.png" 
    }
  ]
}