{
  "title" : "H & H Lawyers Website and Server Migration",
  "titleIconName": "hhlawyerswebsiteandservermigration",
  "subTitle": "Website redevelopment and cloud-based email/server migration",
  "overviewContent": "Redeveloped H & H Lawyers’ website and migrated their email and servers to Microsoft Exchange and AWS, addressing key access and operational limitations. The project delivered a fully multilingual website tailored to stakeholders with an admin panel, improved SEO to secure top search rankings for target clients, and established a scalable, globally accessible cloud infrastructure. Migrating the email server allowed external access, resolved spam filtering issues, and strengthened IT security, boosting overall operational efficiency.",
  "position": "Full Stack Java Developer",
  "period": "12 months (Oct 2019 – Sep 2020)",
  "links": {
    "github": "https://hhlaw.com.au",
    "demo": ""
  },
  "details": {
    "skillIds": [
      "java",
      "springboot",
      "thymeleaf",
      "html",
      "css",
      "javascript",
      "jquery",
      "bootstrap",
      "mysql",
      "mariadb",
      "awsEb",
      "awsLb",
      "awsRoute53"
    ],
    "jd": [
      "Analysed IT limitations and website constraints, identifying critical access issues with on-premises email servers and Wordpress site.",
      "Planned and carried out email server migration to Microsoft Exchange, implementing MFA, security policies, and resolving spam filtering issues to ensure reliable external communication.",
      "Transferred company domain to internal administration, removing reliance on external IT providers and increasing control over IT systems.",
      "Redeveloped a fully multilingual website (English, Korean, Japanese, Chinese) using Spring Boot and Thymeleaf, including an admin panel to enable internal control over content and layout.",
      "Implemented SEO optimisations, including keyword building, meta tags, sitemap generation, and multilingual support, securing top search rankings for target clients.",
      "Deployed the website on AWS Elastic Beanstalk with load balancing for high availability, fast global access, and scalable performance.",
      "Applied MVC patterns and RESTful API architecture for maintainability, intuitive URL structure, and future extensibility.",
      "Participated in all phases of SDLC, collaborating closely with stakeholders, designers, and cross-functional teams to deliver the project on time and within scope.",
      "Conducted unit, integration, and performance testing to ensure reliability, responsiveness, and cross-region accessibility, significantly improving user experience and operational efficiency."
    ]
  },
  "imgs": [
    {
      "desc" : "Main page"
      , "url" : "/images/experiences/hhlawyers-website.png" 
    }
  ]
}