{
  "title" : "H & H Lawyers Intranet",
  "titleIconName": "CgBrowser",
  "subTitle": "Centralised internal resource hub for improved accessibility and operational efficiency",
  "overviewContent": "I developed a comprehensive intranet for H & H Lawyers, designed to enhance internal communication and collaboration among team members. This platform serves as a central hub for accessing essential resources, including company policies, forms, and training materials. By implementing user-friendly features and intuitive navigation, I ensured that employees can easily find the information they need to perform their jobs efficiently. Additionally, the intranet facilitates real-time updates and announcements, fostering a more connected and informed workplace culture within the firm.",
  "position": "Full Stack Java Developer",
  "period": "2 months (Feb 2023 – Mar 2023)",
  "details": {
    "skillIds": [
      "java",
      "springboot",
      "thymeleaf",
      "html",
      "css",
      "javascript",
      "jquery",
      "bootstrap",
      "mariadb",
      "awsEb"
    ],
    "jd": [
      "Collaborated with administrative and operational teams to identify pain points in staff onboarding, resource accessibility, and internal communication.",
      "Designed a scalable intranet architecture with modular components, allowing for future expansion such as search capabilities, document categorisation, and role-based content access.",
      "Integrated direct access links to frequently used internal and third-party systems, reducing navigation time and eliminating the need for multiple bookmarks.",
      "Linked key firm documents—including policies, SOPs, and training guides—ensuring employees have a single authoritative source for updated information.",
      "Implemented an intuitive navigation structure and responsive UI using Thymeleaf, Bootstrap, and JavaScript to ensure accessibility across devices.",
      "Configured secure authentication and access control via Azure Entra ID, ensuring role-appropriate resource visibility.",
      "Deployed the intranet to AWS Elastic Beanstalk with load balancing and DNS configuration through Route 53 for reliability and scalability.",
      "Conducted unit, integration, and usability testing to validate performance, security, and user adoption.",
      "Documented the system design, deployment process, and administration guidelines to support long-term maintainability."
    ]
  }
}
