{
  "title" : "H & H Lawyers Website and Server Migration",
  "titleIconName": "hhlawyerswebsiteandservermigration",
  "subTitle": "",
  "overviewContent": "I developed a new website for H & H Lawyers and successfully migrated their servers from on-premises solutions to Microsoft Exchange and AWS. This project involved creating a modern, user-friendly website that enhances the firm's online presence while ensuring optimal functionality. Additionally, the server migration improved system reliability and scalability, enabling the firm to leverage cloud technology for better performance and data management.",
  "position": "Full Stack Java Developer",
  "period": "12 months (Oct 2019 – Sep 2020)",
  "link": "https://hhlaw.com.au",
  "details": {
    "skills": [
      "OS: Windows"
      , "Tool: Eclipse (Development), DBeaver (RDB)"
      , "Programming: Java, Thymeleaf, HTML, CSS, JavaScript, jQuery, Bootstrap, MySQL"
      , "Framework: Spring Boot"
      , "Database: Maria DB"
      , "Version Control: SVN"
      , "Cloud Services: AWS Elastic Beanstalk, AWS Load Balancer, Route 53, Azure Database, Azure Entra ID"
      , "Other: Agile Methodology, SOLID principles, MVC pattern, RESTful API"
    ],
    "jd": [
      "Analysed user requirements."
      , "Planned and managed the project."
      , "Set up the development/production environment."
      , "Designed and created the database."
      , "Designed and developed the website with a RESTful API using Spring Boot and deployed it to AWS."
      , "Designed and created the database in AWS RDS."
      , "Implemented comprehensive SEO strategies, including writing meta tags, generating a sitemap, optimising keywords, and effectively using HTML tags. Supported multilingual SEO for English, Korean, and Japanese."
      , "Checked web standard validation in alignment with W3C web standards."
      , "Conducted unit testing and integration testing."
      , "Wrote technical documentation and end-user manuals."
      , "Migrated the email server from on-premise to Microsoft Exchange."
      , "Set up security policies in Office 365"
      , "Contributed to all phases of the Software Development Life Cycle (SDLC), collaborating closely with designers, developers, and cross-functional teams to ensure successful project delivery."
    ]
  },
  "imgs": [
    {
      "desc" : "Main page"
      , "url" : "/images/experiences/hhlawyers-website.png" 
    }
  ]
}