{
  "title" : "Individual Performance Dashboard",
  "titleIconName": "individualperformancedashboard",
  "subTitle": "Daily-updated individual and team performance tracking",
  "overviewContent": "I developed an individual performance dashboard to provide employees with a clear overview of their performance metrics and goals. This dashboard aggregates key performance indicators (KPIs) in an easy-to-read format, allowing users to track their progress and identify areas for improvement.",
  "position": "Full Stack Developer",
  "period": "4 months (Oct 2020 – Jan 2021)",
  "details": {
    "skillIds": [
      "powerbi"
      , "dax"
      , "mariadb"
      , "azuredb"
    ],
    "jd": [
      "Analysed user requirements to design dashboards tailored for individual lawyers and team leaders.",
      "Planned and managed the project workflow to deliver actionable insights.",
      "Set up the development and production environment for Power BI reports.",
      "Collaborated closely with designers to evaluate and refine UI/UX for optimal readability.",
      "Extracted and transformed daily-refreshed data from ActionStep and internal databases to accurately calculate billable and non-billable hours, matter allocation, expertise distribution, and collaboration patterns.",
      "Developed Power BI reports showing monthly total hours, billable vs non-billable hours, matter engagement, and senior lawyer collaboration patterns.",
      "Enabled drill-down functionality to navigate directly to specific matters in ActionStep.",
      "Provided different access levels for individual lawyers and team leaders, allowing efficient monitoring of personal and team performance.",
      "Conducted unit and integration testing to ensure reliability and accuracy of the dashboard.",
      "Wrote technical documentation and end-user manuals for maintainability and training."
    ]
  },
  "imgs": [
    {
      "desc" : "Main page"
      , "url" : "/images/experiences/individual-performance-dashboard1.png" 
    },
    {
      "desc" : "Average hours"
      , "url" : "/images/experiences/individual-performance-dashboard2.png" 
    }
  ]
}


