{
  "title" : "One Click Trade Mark Website",
  "titleIconName": "GiClick",
  "subTitle": "Simplified online trademark registration platform",
  "overviewContent": "Developed a professional-grade platform that streamlines trademark registration for clients, reducing time and costs for both clients and lawyers. The system enables clients to submit only essential information, which is then reviewed by patent lawyers before submission, ensuring accuracy and efficiency. Additionally, the platform provides a simplified patent search page by integrating the Australia Trademark API, improving accessibility and user experience for clients.",
  "position": "Full Stack Java Developer",
  "period": "12 months (Oct 2021 – Sep 2022)",
  "links": {
    "demo": "https://oneclicktrademark.com.au/"
  },
  "details": {
    "skillIds": [
        "java",
        "springboot",
        "thymeleaf",
        "html",
        "css",
        "javascript",
        "jquery",
        "bootstrap",
        "mariadb",
        "awsEb",
        "awsLb",
        "awsRoute53"
    ],
    "jd": [
      "Gathered and analysed requirements to simplify the trademark registration process, reducing time and costs for both clients and lawyers.",
      "Designed and implemented a system where clients input minimal required data, which is automatically routed to patent lawyers for review and submission.",
      "Integrated Australia Trademark API to enable simplified and user-friendly patent search functionality.",
      "Developed a secure payment module(PayPal) to support online transactions and automated notifications for internal staff.",
      "Planned and managed the project workflow, ensuring seamless deployment on AWS using Elastic Beanstalk and Load Balancer for scalability.",
      "Designed and implemented the database schema in AWS RDS for reliable data storage and retrieval.",
      "Developed the website using Spring Boot and RESTful API, following MVC architecture and adhering to web standards.",
      "Performed unit and integration testing to ensure system reliability and high-quality user experience.",
      "Implemented SEO strategies to improve online visibility, including optimised meta tags and sitemap generation.",
      "Authored comprehensive technical documentation and user guides, and contributed to all phases of the SDLC with cross-team collaboration."
    ]
  }
}

