{
  "title" : "Narae's Portfolio",
  "titleIconName": "IoPerson",
  "subTitle": "A responsive SPA portfolio showcasing modern React and TypeScript skills",
  "overviewContent": "This portfolio project was developed as a comprehensive personal profile, aimed at showcasing my skills while providing hands-on experience with modern front-end technologies. It utilises React, Next.js, TypeScript, and Tailwind CSS to implement a responsive, multi-device SPA. The project supports theme selection and manages static data, with future database integration planned. The project emphasises component-based architecture, global state management, and user preference persistence to enhance performance, maintainability, and user experience.",
  "position": "Full Stack Engineer",
  "period": "2 weeks (Aug 2025)",
  "links": {
    "github": "https://github.com/Narae-H/portfolio-2025",
    "demo": "https://portfolio-2025-liart-nu.vercel.app/"
  }, 
  "details": {
    "skillIds": [
      "react",
      "nextjs",
      "typescript",
      "tailwindcss",
      "reduxToolkit",
      "reduxPersist"
    ],
    "jd": [
      "Designed and developed a fully responsive SPA portfolio using React, Next.js, TypeScript, and Tailwind CSS to support desktop, tablet, and mobile devices.",
      "Structured static data with unique identifiers to enable future database integration while maintaining efficient rendering and performance.",
      "Implemented component-based architecture to enhance reusability, maintainability, and consistency across the application.",
      "Utilised Redux Toolkit and Redux Persist for global state management, reducing prop-drilling and ensuring user preference persistence, including theme selection stored in localStorage.",
      "Managed GitHub projects for task tracking within a solo development workflow.",
      "Established consistent commit conventions and templates (.github folder with bug_report.md, feature_request.md, task.md) to maintain code quality and standardise workflow.",
      "Deployed the portfolio on Vercel with automated production deployment triggered by commits to the main branch.",
      "Implemented a Git branch strategy using main, develop and feature branches to organise feature development and releases."
    ]
  }
}
